Series

In [166]:
import pandas as pd
obj = pd.Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [167]:
obj1 = pd.Series([4,7,-5,3], index = ['d','b','a','c'])
obj1

d    4
b    7
a   -5
c    3
dtype: int64

In [168]:
print(obj.index)

RangeIndex(start=0, stop=4, step=1)

In [169]:
obj1['a']

-5

In [170]:
obj1[['c','a','d']]

c    3
a   -5
d    4
dtype: int64

In [171]:
obj1>0

d     True
b     True
a    False
c     True
dtype: bool

In [172]:
'b' in obj1

True

In [173]:
Sdata = {'Ohio':35000, 'Texas':71000, 'Oregon':16000, 'utah':5000}
obj2 = pd.Series(Sdata)
print(obj2)

Ohio      35000
Texas     71000
Oregon    16000
utah       5000
dtype: int64

In [174]:
States = ['California', 'Ohio', 'Oregon', 'Texas']
obj3 = pd.Series(Sdata, index = States)
print(obj3)

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [175]:
pd.isnull(obj3)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [176]:
pd.notnull(obj3)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [177]:
obj2+obj3

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
utah               NaN
dtype: float64

In [178]:
obj3.index.name = "States"

In [179]:
obj3.name = 'population'

Dataframes

In [180]:
data = {'state': ['Ohio','ohio','Ohio','Nevada','Nevada','Nevada'], 'year':[2000,2001,2002,2001,2002,2003], 'pop':[1.5,1.7,3.6,2.4,2.9,3.2]}
frame = pd.DataFrame(data)

In [181]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [182]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [183]:
pd.DataFrame(data, columns = ['year', 'state', 'pop', 'debt'])

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [184]:
frame.columns

Index(['state', 'year', 'pop'], dtype='object')

In [185]:
frame['state']

0      Ohio
1      ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [186]:
frame.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [187]:
frame['debt'] = 16.5
print(frame)

    state  year  pop  debt
0    Ohio  2000  1.5  16.5
1    ohio  2001  1.7  16.5
2    Ohio  2002  3.6  16.5
3  Nevada  2001  2.4  16.5
4  Nevada  2002  2.9  16.5
5  Nevada  2003  3.2  16.5

In [188]:
import numpy as np
frame['debt'] = np.arange(6)
frame

    state  year  pop  debt
0    Ohio  2000  1.5     0
1    ohio  2001  1.7     1
2    Ohio  2002  3.6     2
3  Nevada  2001  2.4     3
4  Nevada  2002  2.9     4
5  Nevada  2003  3.2     5

In [189]:
frame['debt'] = np.arange(6.)
frame

    state  year  pop  debt
0    Ohio  2000  1.5   0.0
1    ohio  2001  1.7   1.0
2    Ohio  2002  3.6   2.0
3  Nevada  2001  2.4   3.0
4  Nevada  2002  2.9   4.0
5  Nevada  2003  3.2   5.0

In [190]:
val = pd.Series([-1.2,-1.5,-1.7], index = [2,4,5])
frame['debt']=val

In [191]:
frame

    state  year  pop  debt
0    Ohio  2000  1.5   NaN
1    ohio  2001  1.7   NaN
2    Ohio  2002  3.6  -1.2
3  Nevada  2001  2.4   NaN
4  Nevada  2002  2.9  -1.5
5  Nevada  2003  3.2  -1.7

In [192]:
del frame['pop']

In [193]:
frame

    state  year  debt
0    Ohio  2000   NaN
1    ohio  2001   NaN
2    Ohio  2002  -1.2
3  Nevada  2001   NaN
4  Nevada  2002  -1.5
5  Nevada  2003  -1.7

In [194]:
pop = {'Nevada':{2001:2.4,2002:2.9},'Ohio':{2000:1.5,2001:1.7,2002:3.6}}
frame3 = pd.DataFrame(pop)
print(frame3)

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [195]:
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [196]:
pdata = {'Ohio':frame3['Ohio'][:-1],'Nevada':frame3['Nevada'][:2]}
pd.DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

In [197]:
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

Index Objects

In [198]:
import pandas as pd
obj4 = pd.Series(range(3), index = ['a','b','c'])
index = obj4.index
print(index)

Index(['a', 'b', 'c'], dtype='object')

In [199]:
index[1:]

Index(['b', 'c'], dtype='object')

Re-indexing

In [200]:
obj = pd.Series([4,7,-5,3], index = ['d','b','a','c'])
obj

d    4
b    7
a   -5
c    3
dtype: int64

In [201]:
obj2 = obj.reindex(['a','b','c','d','e'])
obj2

a   -5.0
b    7.0
c    3.0
d    4.0
e    NaN
dtype: float64

In [202]:
obj3 = pd.Series(['blue','green','yellow'], index = [0,2,4])
obj3

0      blue
2     green
4    yellow
dtype: object

In [203]:
obj3.reindex(range(6), method = 'ffill')

0      blue
1      blue
2     green
3     green
4    yellow
5    yellow
dtype: object

In [204]:
import numpy as np
frame = pd.DataFrame(np.arange(9).reshape((3,3)), index=['a','b','c'], columns=['Ohio','Texas','California'])
frame

   Ohio  Texas  California
a     0      1           2
b     3      4           5
c     6      7           8

In [205]:
frame2 = frame.reindex(['a','b','c','d'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   3.0    4.0         5.0
c   6.0    7.0         8.0
d   NaN    NaN         NaN

In [206]:
states = ['Texas','Utah','California']
frame.reindex(columns = states)

   Texas  Utah  California
a      1   NaN           2
b      4   NaN           5
c      7   NaN           8

Droping entries from an axis

In [207]:
obj = pd.Series(np.arange(5), index = ['a','b','c','d','e'])
obj

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [208]:
obj.drop(['b','c'])

a    0
d    3
e    4
dtype: int32

In [209]:
obj

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [210]:
obj.drop('c', inplace = True)
print(obj)

a    0
b    1
d    3
e    4
dtype: int32

Indexing, Selection and Filtering

In [211]:
obj[1]

1

In [212]:
obj[2:4]

d    3
e    4
dtype: int32

In [213]:
obj[['b','a','d']]

b    1
a    0
d    3
dtype: int32

In [214]:
obj['b':'c'] = 5

In [215]:
obj

a    0
b    5
d    3
e    4
dtype: int32

In [216]:
data = pd.DataFrame(np.arange(9).reshape((3,3)), index=['Ohio','Utah','New York'], columns=['One','Two', 'Three'])
data

          One  Two  Three
Ohio        0    1      2
Utah        3    4      5
New York    6    7      8

In [217]:
data.drop('Two',axis = 1)

          One  Three
Ohio        0      2
Utah        3      5
New York    6      8

In [218]:
data[:2]

      One  Two  Three
Ohio    0    1      2
Utah    3    4      5

In [219]:
data[data.Three>5]

          One  Two  Three
New York    6    7      8

In [220]:
data < 5

            One    Two  Three
Ohio       True   True   True
Utah       True   True  False
New York  False  False  False

In [221]:
data[data<5] = 0

In [222]:
data

          One  Two  Three
Ohio        0    0      0
Utah        0    0      5
New York    6    7      8

Selection with loc and iloc

In [223]:
data.loc['Utah', ['Two', 'Three']]

Two      0
Three    5
Name: Utah, dtype: int32

In [224]:
data.iloc[1,[2,0,1]]

Three    5
One      0
Two      0
Name: Utah, dtype: int32

In [225]:
data.iloc[2]

One      6
Two      7
Three    8
Name: New York, dtype: int32

In [226]:
data.iloc[[1,2],[2,0,1]]

          Three  One  Two
Utah          5    0    0
New York      8    6    7

In [227]:
data.loc[:'Utah','Two']

Ohio    0
Utah    0
Name: Two, dtype: int32

In [228]:
data.iloc[:,:3][data.Three>5]

          One  Two  Three
New York    6    7      8

Integer Indexes

In [229]:
sr = pd.Series(np.arange(3.0))
sr

0    0.0
1    1.0
2    2.0
dtype: float64

In [231]:
sr1 = pd.Series(np.arange(3.0), index = ['a','b','c'])
sr1

a    0.0
b    1.0
c    2.0
dtype: float64

In [232]:
sr1[-1]

2.0

In [233]:
sr1[:1]

a    0.0
dtype: float64

In [235]:
sr1.iloc[:1]

a    0.0
dtype: float64

Function

In [241]:
frame4 = pd.DataFrame(np.random.randn(4,3), columns = list('bde'), index = ['Utah', 'Ohio', 'Texas', 'Oregon'])
frame4

               b         d         e
Utah    0.204655 -0.325343  1.225080
Ohio   -0.817101  0.410036 -0.457985
Texas   0.486693 -0.148177  0.041610
Oregon -0.710612  1.656348 -0.057201

In [242]:
np.abs(frame4)

               b         d         e
Utah    0.204655  0.325343  1.225080
Ohio    0.817101  0.410036  0.457985
Texas   0.486693  0.148177  0.041610
Oregon  0.710612  1.656348  0.057201

In [251]:
f = lambda x : x.max() - x.min()
frame4.apply(f)

b    1.303794
d    1.981691
e    1.683066
dtype: float64

In [252]:
frame4.apply(f, axis = 'columns')

Utah      1.550423
Ohio      1.227137
Texas     0.634870
Oregon    2.366960
dtype: float64

In [253]:
def f(x):
    return pd.Series([x.max(), x.min()], index = ['min', 'max'])
frame4.apply(f)

            b         d         e
min  0.486693  1.656348  1.225080
max -0.817101 -0.325343 -0.457985

In [254]:
f = lambda x : np.round(x,2)
frame4.apply(f)

           b     d     e
Utah    0.20 -0.33  1.23
Ohio   -0.82  0.41 -0.46
Texas   0.49 -0.15  0.04
Oregon -0.71  1.66 -0.06

In [257]:
format = lambda x : '%.2f'%x
frame4.applymap(format)

            b      d      e
Utah     0.20  -0.33   1.23
Ohio    -0.82   0.41  -0.46
Texas    0.49  -0.15   0.04
Oregon  -0.71   1.66  -0.06

In [258]:
frame4['e'].map(format)

Utah       1.23
Ohio      -0.46
Texas      0.04
Oregon    -0.06
Name: e, dtype: object